Repository: mozilla-l10n/mt-training-data
Catalog: ssi/ssi_pontoon.tmx
Source language: en_us
Languages: ssi

source: Technology that speaks your language
ssi: ٹیکنالوجی جکو آپ کی بھاشا ٻولتی ہے

source: TED-LIUM Corpus
ssi: ٹی ای ڈی-ایل آئی یو ایم کتھا

source: Teke
ssi: ٹیکے

source: Tell us what you'd like to download:
ssi: ہمکُو بھتاؤ کہ آپ کیا ڈاؤن لوڈ کرنا چاہوتے ہو:

source: Telugu
ssi: تیلگو

source: Tepeuxila Cuicatec
ssi: ٹیپیکسلا کُکٹیک

source: Terms
ssi: سرتاں

source: <termsLink>Terms</termsLink>
ssi: <termsLink>ٻندھِیاں</termsLink>

source: Teutila Cuicatec
ssi: ٹیوٹیلا کُکٹیک

source: Thai
ssi: تھائی

source: Thanks for confirming your account, now let's build your profile.
ssi: اپݨیں کھاتے کی پک کرنے کا دھنیواد، اِٻکے آؤ تھارا پروپھائل ٹھاواں.

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
ssi: 50 سے ودھیک ٻولِیئینٚم 259،000 سے ودھیک منکھیں کے یوگدؔاناس ، اِس ڈیٹا کُو انسانی اواجا کا اجرا جباب دؔیٹؔیں نتر ٻولٹؔیں کے دؔیسی ٻِنتِیا کُو سیکشا دؔیٹؔیں نتر اُپیوگ کرا جائی را ہے۔

source: Thank you for contributing to Spontaneous Speech!
ssi: بے دھڑک بھاشݨام بھاگ لیݨیں نتر آپ کا دھنیواد!

source: Thank you for contributing your bulk submission!
ssi: تھارا سپا گھٹا جما کراٹؔیم پاتی ٻہاٹؔے کرے تھارا دھنیواد!

source: Thank you for contributing your voice!
ssi: تھاری اواجام پاتی ٻاہݨیں نتر تھارا دھنواد!

source: Thank you for donating your voice clips!
ssi: اپٹِؔیں اواجا کے ٹُکڑے دؔان کرنے نتر تھارا دھنواد!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
ssi: ریکارڈنگا نتر تھارا دھنواد! <lineBreak></lineBreak>اِٻکے اِدؔائے دؔیکھو اور نیچے اپٹؔے ٹُکڑے بھیݪے کرو۔

source: Thank you for your information
ssi: آپ کی جاݨکارِیا نتر دھنِیواد

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
ssi: { $lang } میں پاتی ٻاݨیم تھاری رُچیا نتر تھارا دھنواد۔ ہم ہر ٻولیا کُو لانچا نتر تیار کرنے اور ٻݨائی راکھݨیں نتر کٹھن محنت کرتے ہے سںٚگّٹھنے کُو ای میلا جریئے اپ ڈیٹ کرا. اگر تھم یوگدان کرنا چاہوتے ہے تو، کِرپا کری کن نیچے اپنا ای میل دؔی دؔو.

source: Thank you for your voice information
ssi: تھاری اواجا کی جاݨکاریا کرے تھارا دھنواد

source: Thank you! You’ve sent a new language enquiry
ssi: دھنواد! تھمُون ایک نویں ٻولیا کی ٻُوجھ تاچھ گِھلائی ہے

source: The best sentences are natural and conversational — they should be easy for someone to read. While phonetic diversity and different words in sentences is important, we are also trying to make recording sentences as engaging and fun for our volunteer community as possible.
ssi: بڑِیا ٻول پرکِرتک اور ٻات ٻِگتاپ ٻݨوڑی ہووتی ہے - ٻو کِسی کے نتر پڑھنیم سُکی ہوونا چاہِجے. بلکے اواج پھرک اور ٻولیم نِیارے لوَج کھاس ہے ، پݨیں ہم اپݨی سیوک کُوماں نتر ریکارڈنگ ٻولیں کُو ودھ میں ودھ وݨنواڑا اور آنند مئی ٻݨاݨیں نتر بھی جتن کری رے ہے۔

source: The best sentences for building a useful speech recognition engine are colloquial, modern parlance. Some ideas to help you generate sentences are;
ssi: ایک اجری ٻول چالا کی اوݪکھ کا اِرجݨ ٹھاوݨیں نتر اجرے ڈؔوہیڑے ٻول چال، نوِیں بھاشا ہے. ٻول ٹھاوݨیں آپ کی ساہیتا کرنے نتر کانٚھِیں وِچار یہ ہے؛

source: The bumblebee sped by.
ssi: بھنٚورا تکڑا آگے اُڈؔی گا۔

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
ssi: کلپ مُساݨ اوَاجیں کے کلپینٚپ ٻٹؔوڑا ہے جکو اِسکُو سادھارٹؔ اوَاج ڈیٹا سیٹام نائیں ٻٹؔاوَے۔ رُگی ڈیٹا سیٹا جُو ، کلپ مُساݨ ڈاؤن لوڈا نتر ماجُود ہے۔

source: The clip has disrespectful or offensive language.
ssi: ٹُکڑیم اپمان جنک یا بے لکھٹؔی ٻولی ہے۔

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
ssi: سادھارٹؔ اوَاجا کے ڈیٹا سیٹام سوَِیں ہجاریں اوَاجا کے نامُونے سیمݪ ہے جکو ترکی دؔیݨوَاڑے کُو اوَاجا کُو اوݪکھٹؔیں کے اوجار ٻٹؔاوَٹؔینٚم ساہیتا کرتے ہے۔

source: The community is the beating heart of Common Voice - they come from all over the world, and are language activists and scientists and artists. You can learn more about how to get involved on our <about>About</about> page and in our <community>Community playbook</community>. If you're interested in deeper organisational partnership, <emailFragment>get in touch.</emailFragment>
ssi: پڑاوَ سادھارݨ اواجا کا دھڑکتوڑا دل ہے - ٻو پُورے سنساراس آوتے ہے، اور ٻولیا کے کاھرِیئے کرنواڑے، وِگیانِک اور کلاکار ہے. تھم مھارے باریم پنیپ اور مھارے <community>پڑاو پلے بُکام</community> سیمل ہووݨیں <about>کے باریم</about> ودھِیک جاݨی سِکتے ہے۔ جے اگر تھم ٻڈؔے سںٚگّٹھن یوگدانام رُچی راکھتے <emailFragment>ہے تو ، سمپرک کرو۔</emailFragment>

source: The content contains a language different than I was expecting.
ssi: سیمانام ایک ایسی ٻولی سیمݪ ہے جس کی ہُوں اُمید کری را تِیا۔

source: The content has disrespectful or offensive language.
ssi: سیمانام اپمان جنک یا آپتی جنک بھاشا ہے۔

source: The giant dino [cough] the Triassic.
ssi: وِشال کائے ڈائنا سور [کھانگ] ٹریاسک۔

source: The giant dinosaur of the Triassic.
ssi: پُراتن سمے کا وِشال کائے ڈائیناسور

source: The giant dinosaurs of the Triassi-.
ssi: ٹریاسکا کے ٻڈؔے ڈایناسور۔

source: The giant dinosaurs of the Triassic.
ssi: پُراتن سمے کا وِشال کائے ڈائناسور

source: The giant dinosaurs of the Triassic. [read by one voice]
ssi: ٹریاسکا کے وِشال کائے ڈائناسور۔ [ایکی اواجام پڑھو]

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
ssi: پُرات سمے کے سپا ٻڈؔے ڈایناسور۔ <strong>[ایک اوَاجاس پڑھو]</strong>

source: The giant dinosaurs of the Triassic. Yes.
ssi: ٹریاسکا کے دیوَ ہیکل ڈایناسور۔ جی ہاوَے۔

source: The giant dino <strong>[cough]</strong> the Triassic.
ssi: دیو ڈائنو <strong>[کھانٚگ]</strong> پُرتن کال۔

source: The MediaRecorder API is not supported in your browser.
ssi: تھارے بھائی یئین MediaRecorder API بھِیر نائِیں لی۔

source: The number of recordings and which languages you contribute to will be public.
ssi: ریکاڈنگا کی گینتی اور تھم کُوݨ سی ٻولِیئینٚم دؔان دؔیتے ہے یو کھلکا نتر ہووں گا۔

source: The page you are looking for could not be found
ssi: جِس پنے کُو آپ لوڑی رے ہے ٻو نائِیں مِلا

source: The question should be answerable in just a couple of sentences.
ssi: اس سُئالا کا جباب رُگی تھوڑے ٻولینٚم دؔیݨاں چاہِجے۔

source: There are currently no prompts for this language. Please refresh the page or try again later.
ssi: ہلی اس ٻولیا نتر کوئی جھالے ماجُود نائیں تِیئیں۔ کِرپا کری پنیں کُو تاجا کرو یا پیچھیں پُوٹھا یتن کرو۔

source: There are currently no prompts to validate for this language. Please refresh the page or try again later.
ssi: اس ٻولِیا نتر اِٻکے پک کرنے نتر کوئی پرامپس نائیں تِیا۔ کِرپا کری پنے کُو تاجا کر یا پِچھیں پُوٹھوانٚس جتن کر۔

source: There are currently no sentences to review in this language.
ssi: ہلی اِس بھاشام دؔیکھٹؔیں نتر کوئی ٻول ماجُود نائِیں تِئے۔

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
ssi: اِٻکے اِس ٻولِیا کی جانچ کرنے نتر کوئی نکݪ ماجُود نائِیں تی۔ کِرپا کری پنے کُو تاجا کر یا پِچھِیں پُوٹھا جتن کر۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
ssi: بھاشا کے باریم سوچٹؔیں کے گھٹؔے سارے نامُونے ہے. ٻولٹؔیں کی اوݪکھا کے نامُونے کے اُدؔیسیں نتر ، سادھارٹؔ اوَاج چُنتا ہے کہ 'آپسام ' دھِیان دِؔیوَے ، یا 'جےاگر ٻو جتن کرے تو کِیا اِس بھاشا کے ٻوݪٹؔ وَاڑے گھٹؔیں کرے ایکی دُؔوجے کُو سمجی سِکتے ہے؟

source: The recording was too long.
ssi: ریکارڈنگ سپا لامٻی تی۔

source: The recording was too quiet.
ssi: ریکارڈنگ سپا شانت تی۔

source: The recording was too short.
ssi: ریکارڈنگ سپا لھوڑی تی۔

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
ssi: ہلی اس ٻولیا نتر نکݪ کرنے نتر کوئی آڈیو ماجُود نائیں تی۔ کِرپا کری پنیں کُو نئوا کرو یا پِجھیں پُوٹھا جتن کرو۔

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
ssi: سرے کی ٻات ہے سروت لِکھتام کوئی گِنتی نائیں ہووݨی چاہجے کیونکہ ٻو اُونچی اواجام پڑھنیم دُؔکھی کری سِکتے ہے۔ لمبرا کُو پڑھنے کے نامُونے کے باریم نِربھر ہے اور ڈیٹا سیٹام اُلجھن بہائی سِکتا ہے۔ سرے کی ٻات ہے ، لمبر "2409" کُو "چوئیس جیرو نوں" اور "دؔو ہجار چار سو نوں" دُؔنھیں کُو ٻِروٻر سئی پڑھی سِکتے ہے۔

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
ssi: پڑھنواڑے کے ٻِچام پُورا سُورا پراکرتک بدلاوَ ہؤنگا۔ رُگی اِس ہالتام چھوڈؔی دؔیو جِدؔ ویلا اِترا گھٹؔا ہووے کہ بھروڑی اواج ٹُوٹی جاوے، یا ( سپا سادھارݨ رُوپ ) جے اگر ٻو اِترا گھٹ ہووے کہ تھم لِکھوڑے کتھنا کے سَرے کے ٻِینا جکو کائِیں کیہِیرا ہے اُس کُو نائیں سُٹؔی سِکے۔

source: The route was unclear.
ssi: ٻاٹ سئی نائیں تی تی۔

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
ssi: یہ ٻولیاں ہلی اِٻکے پڑاو ویکاسا مئھیم ہے۔ لانچ کرنے نتر <localizationGlossaryLink>ویب سائٹ سادھارݨ</localizationGlossaryLink> اور <sentenceCollectionGlossaryLink>ٻول جما</sentenceCollectionGlossaryLink> کرنے کی جرورت ہے۔

source: The selected file is too large
ssi: چُنوڑی پھائل سپا ٻڈؔی ہے

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
ssi: ٻول بھیݪے کرنواڑی بُڑاند سادھارݨ اوَاج پلیٹ پھارماپ جائِیرا ہے۔ اِٻکے آپ سادھارݨ اوَاجاپ ایک ٻول <writeURL>لِکھی</writeURL> سِکتے ہے یا ایکلا ٻول جما کراوَٹؔیں کا <reviewURL>جائجا لی</reviewURL> سِکتے ہے۔

source: The sentence has a grammatical or spelling error.
ssi: اِن ٻولّینٚم نِیتی یا ہِجے کی چُونک ہے۔

source: The sentence has disrespectful or offensive language.
ssi: ٻولیم اپمان جنک یا بے لکھٹؔی بولی ہے

source: The sentence must be grammatically correct.
ssi: ٻولا کُو کتارا کے ہِساباس سئی ہووَٹؔاں جروری ہے۔

source: The sentence must be speakable.
ssi: یوٻول ٻولٹؔیں دؔیسا ہووَٹؔاں چاہِجے۔

source: The sentence must be spelled correctly.
ssi: ٻولا کُو سئی نامُونیس لِکھا جاوَٹؔاں چاہِجے۔

source: The sentence should have fewer than 15 words.
ssi: ٻولینٚم 15 سے گھٹ لوج ہوݨیں چاہئیں۔

source: The site is ready to be launched when it reaches 75% completion.
ssi: جِدؔ یو 75٪ نِوَیڑا ہوئی جاوَتا ہے تو سائٹ سِرُو کرنے نتر تیار ہے.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
ssi: یو سائٹ ٻیگی ئی پُوٹھوانٚس چالُوں گی. نویں جاݨکاریا نتر، کِرپا کری <matrixLink>میٹرکس پڑاو چیٹام</matrixLink> سیمل ہووَ یا سائٹا کے انبھو کے مسلیں کُو جما کرنے اور نِگھا کرنے نتر <githubLink>گیٹ ہب</githubLink> یا <discourseLink>مھارے ڈسکورس چوکاپ</discourseLink> یاترا کرو.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
ssi: ٹی ای ڈی-ایل آئی یو ایم کتھا آڈیو کچیری اور ٹی ای ڈی ویب سائٹاپ ماجُود ان کی نکلاس ٻݨایا تیا۔

source: The website text is translated into that language.
ssi: ویب سائٹا کا لِکھوڑا اِسی بھاشام انواد کرا ہے۔

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ssi: اس سیمانام کسی مِنکھا کی اوݪکھاس جُڑوڑی اپݨیں آپ سے اوݪکھݨیں جوگی جاݨکاری سیمݪ ہے ، جِدؔا اِس کا نانٚوَ، ای میل پتا ، جاگھا ، اوݪکھݨیں کا لمبر ، یا پھون لمبر۔

source: This content is asking for personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ssi: یو سیمان کسی مِنکھا کی اوݪکھاس جُڑوڑی اپݨیں آپ سے اوݪکھݨیں جوگی جاݨکاری ٻُوجھی رہا ہے ، جِدؔا اس کا نانٚوَ ، ای میل پتا ، جاگھا ، اوݪکھݨیں کا لمبر ، یا پھون لمبر۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
ssi: یو جاݨکاری دؔیوٹؔیں نتر اجری ہے۔ تھمکُو یو رُگی اسی ہالتام بھیݪے کراوٹؔیں چاہِجے اگر تھمکُو اِدؔائے لکھاوے جِدؔ ہم سیمان بھیݪا کرتے ہے تو، ہم سیمان بھیݪا کرا کراں تو، ہم ساری اپݨی جاݨکاریا کُو نکݪی نانٚو دؔیوتے ہے، اور اِس ٻاتا کُو ساچی ٻٹؔاوتے ہے کہ تھارا نانٚو اور ای میلا دؔیسی جاݨکاری اُومر یا یون ٻسِیواݨیں کی جاݨکاریاس چُڑے متی ریہو۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
ssi: یو جاݨکاری لیوَݨیں کا ادھِیکار ہے - آپ کُو یو رُگی اَسی ہالتام سیمݪ کرنا چاہِیجے اگر آپ کُو سوہرا لکھائِیرا ہے۔ جِدؔ ہم ڈیٹا سیٹ چھوڈؔتے ہے تو ، ہم ساری اپݨِیں جاݨکارِیا کُو نکݪی نانٚو دؔیتے ہے ، اور اس ٻاتا کُو پکی کرتے ہے کہ آپ کا نانٚو اور ای میلا دؔیسی جاݨکاری اُومر یا نسݪا دؔیسی ٻسِیواݨیں کی جاݨکارِیاس جُڑوڑی نائیں ہووَے۔ ٹیکنالوجیا کُو ہر ایکی نتر اجرے نامُونینٚس کام کرنے نتر، ڈیٹا جکو ترکی دؔیݨواڑے کُو ٹیکنالوجی ٹھانٚوَݨینٚم ساہِیتا کرتا ہے اِسکُو مِنکھیں کی نِیاری پوہنٚچا کا اُرھاٹؔاں کرنے کی جرورت ہے. میٹا ڈیٹا کاکام اہم ہے اس کے باریم ودِھیک جاݨوں۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
ssi: ایٹھے ایک اُپیوگا کے ماملیپ ٻݨوڑا ٹُکڑا ہے جِن میں ٻولنواڑے گینتیا کی اوݪکھ اور ہاں / ناں کی جانچ کرنے نتر گِنتِیام سیمل ہے۔

source: This is how you cite yourself if you wrote the content yourself.
ssi: اگر تھمُون آپ سیمان لِکھا ہے تو تھم اپݨیں آپ کُو اِدؔا سرا دیتے ہے۔

source: This project would not be possible without people like you. 🎉 There are many ways to get involved with Common Voice - you don't have to know how to code to contribute!
ssi: یو یوجنا تھارے دؔیسے مِنکھیں کے ٻنا نائیں ہوؤں گی۔ 🎉 سادھارݨ اواجا کے سات سیمݪ ہووݨیں کے گھݨے ئی ترِیکے ہے - تھم کُو یو اوݪِکھݨیں کی جرورت نائیں تی کہ یوگدؔان کرنے نتر کوڈ کِدؔا کرنا ہے!

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
ssi: یو کتار آپ کے مُکھی بوڈا کے متا کُو کابُو کرتی ہے۔ جِدؔ چھپی جاوے تو، آپ کی پرگتی اپٹؔی ہوؤںٚگی. اس کا متلب ہے کہ آپ کا پھوٹُو ، چلاݨواڑے کا نانٚو اور پرگتی مُکھی بوڈاپ چاوی نائیں ہووے۔ دھیانام راکھو کہ مُکھی بوڈ ریفریش بدلاوا کُو ٻسیواݨ کرنے نتر ~{ $minutes }منٹ لگاوتا ہے۔

source: Three to go!
ssi: تین جٹؔے ہے!

source: Thur
ssi: تھر

source: Tibetan
ssi: تِبّتی

source: Tigre
ssi: ٹیگر

source: Tigrinya
ssi: تیگرینیا

source: Tlazoyaltepec Mixtec
ssi: تلازوئلٹیک مکسٹیک

source: Toba Qom
ssi: ٹوبہ قُم

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
ssi: اپݨیں ای میلا کُو مَٹاوݨیں یا توڑ جوڑ کرنے نتر، ہمکُو <emailFragment>commonvoice@mozilla.com</emailFragment> کُو ایک ای میل گلاؤ

source: Today
ssi: آج

source: Today's Common Voice progress on clips recorded
ssi: ریکارڈ کروڑے ٹُکڑینٚپ آج کی سادھارٹؔ اواجا کی پرگتی

source: Today's Common Voice progress on clips validated
ssi: ٹُکڑینٚپ آج کی سادھارݨ اواجا کی پرگتی پکی ہے

source: Today's Progress
ssi: آج کی ترکی

source: Toki Pona
ssi: توکی پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
ssi: اسکُو سادھارٹؔ اوَاجا کی ڈیٹا سیٹام ٻٹؔاوَٹؔیں نتر ، اوَاجا کے کلپا کُو دؔو نِیارے نِیارے چلاٹؔوَاڑے کے جرِیئے پک کرنا جروری ہے۔

source: Too many files
ssi: گھٹِؔیاں سارِیاں پھائلاں

source: Top Contributors
ssi: سارینٚس ودھِیک یوگدؔان کروڑا

source: Torwali
ssi: توروالی

source: Total
ssi: کُل

source: Total Approved
ssi: کُل سُئِیکار کروڑے

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
ssi: ساجے پاسے ہم پھوائدے کی رُوپ ریکھا دِؔیرے ہے اور اسپشٹ کرتے ہے کہ ہم کوٹؔ سی جانݨاریا کُو سادھارن کرتے ہے۔ اپٹؔے اوجاراپ سادھارݨ اواج کھاتے کے سات سرو کرنے نتر نیچے دؔیوڑے لنکیں کا اُپیوگ کرو۔

source: Toward next goal
ssi: اگلے لکشئہ دھک

source: Track progress here and on your stats page.
ssi: اپݨی ترکی ایٹھے اور اپݨا اسٹیٹس پنیپ جانٚچ کر۔

source: Transcribe
ssi: نکݪ کر

source: Transcribe answers
ssi: جباب لِکھو

source: Transcribe Audio
ssi: نکݪ آڈیو

source: Transcribe audio recordings into text
ssi: آڈیو ریکارڈنگا کُو متنام نکل کرو

source: Transcribe audio recordings in your language
ssi: آڈیو ریکارڈنگا کُو اپٹؔیا بھاشام نکل کرو

source: Transcribe Audio <small>(Coming soon)</small>
ssi: نکݪ آڈیو <small>(ٻیگا ئی آئی را ہے)</small>

source: Transcript edited successfully
ssi: ٹرانسکرپٹ سپھلتاس توڑ جوڑ کری دؔی

source: Transcript skipped successfully
ssi: ٹرانسکرپٹ سپھلتا کے سات چھوڈؔی دِؔیا

source: Transcript submitted successfully
ssi: ہر ایک لِکھت سپھلتا کے سات جما کرائی دؔی

source: Transcript voted successfully
ssi: ٹرانسکرپٹان سپلتاس ووٹ دِؔیا

source: Transgender
ssi: ٻِسر نسݪ

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
ssi: <translateVideoLink>پونٹونا کُو چلاوَٹؔیں کے باریم مھاری مارگ درشک دیکھو۔</translateVideoLink>

source: Translating the site
ssi: سائٹا کا انوَاد

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
ssi: انواد انگریجِیاس ہے، پٹؔ تھم دُؔوجی <strong>ٻولِیئینٚم سُجھاو</strong> دیکھی سِکتے ہے. پروپھائلام آئی کن <strong>پ</strong> دؔٻاوَ ، پِچھیں لیٹِؔیں کُو لنک <strong>کرو</strong> اور کسی بھی بھاشا کُو سیمݪ کرو جکو آپ ٻولتے ہے۔ نِیچے سونٚݪے کُھونٚٹؔیم انوَادیں کی ایک سُوچی ہوؤنٚگڑی جِس کُو <strong>لوکلز</strong> کیہوَتے ہے۔ ایکی دِؔنا کے پِچھیں ویب سائٹاپ انوَاد دِؔکھاوَتے ہے۔

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
ssi: سادھارٹؔ اوَاج سائٹا کا انوَاد <strong>پونٹوناپ</strong> ہووَتا ہے۔

source: Try again by dragging your file here
ssi: اپنی پھائلا کُو ایٹھے گھِیسی کن پُوٹھا جتن کرو

source: Try uploading again
ssi: پُوٹھا اپ لوڈ کرنے کا جتن کرو

source: Tshivenda
ssi: تسھیوندا

source: Tunen
ssi: ٹونین

source: Tupuri
ssi: ٹوپوری

source: Turkish
ssi: تُرکی

source: Turkmen
ssi: ترکمان

source: Tush
ssi: تش

source: Tuvan
ssi: تُووان

source: Twi
ssi: توی

source: Typically megabytes
ssi: گھݨیں کرے میگا بائٹس

source: Ubykh
ssi: اُوبیکھ

source: Udmurt
ssi: اودمُرت

source: Ukrainian
ssi: یوکرینی

source: Understand contribution criteria
ssi: یوگدانا کا ماݨک جاݨوں

source: Understand how to contribute and validate on the Common Voice dataset
ssi: سادھارݨ اواج ڈیٹا سیٹاپ یوگدؔان دؔیݨیں اور پک کرنے کا نامُونا سمجو

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
ssi: سمجو کہ اوَاجا کا ٹُکڑا سُٹؔتییاٹؔیں کِیا لوڑنا ہے اور اپٹِؔیں اوَاجا کُو وَدھِیک اجری ٻٹؔانٚوَٹؔینٚم ساہِیتا کرو!

source: Universities, Academics and Researchers
ssi: یونیورسٹِیاں، ہوسیار سِکھِیا اور جانچ کرنواڑے

source: Upload aborted. Do you want to delete your recordings?
ssi: اپ لوڈ روکی دِؔیا۔ کیا آپ اپنی ریکارڈنگیں کُو مِٹاوَݨا چاہوتے ہے؟

source: Upload an image file
ssi: پھوٹُو پھائل اپ لوڈ کرو

source: { $uploadedQuestions } of { $totalQuestions } questions collected
ssi: { $uploadedQuestions } { $totalQuestions } سُئالیں کُو جما کراوَڑے

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
ssi: { $totalQuestions } سُئالیں کا { $uploadedQuestions } جما کروڑا ہے۔ سُئالیں کُو سیمݪ کرنے کے نامُونے کے باریم ودھِیک جاݨنے نتر مھارے <guidelinesLink>مارگ دِؔکھاݨواڑے</guidelinesLink> کے پنیں دؔیکھو

source: { $uploadedSentences } of { $totalSentences } sentences collected
ssi: دُؔوجے { $uploadedSentences } میں سے { $totalSentences } ٻول بھیݪے کرے ہے

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
ssi: { $totalSentences } ٻولیں کُو { $uploadedSentences } جما کرا ہے۔ چھوڈؔوڑے ٻول ڈاؤن لوڈ کرنے نتر <downloadLink>ایٹھے</downloadLink> دؔٻاؤ۔

source: Upload failed, please retry.
ssi: اپ لوڈ ناکام، کِرپا کری پُوٹھوانٚس یتن کرو.

source: Upload <icon></icon> public domain sentences
ssi: عوامی ڈومین ٻول اپ لوڈ کر <icon></icon>

source: Upload in progress...
ssi: اپ لوڈ ہوئیرا ہے...

source: Upload more sentences?
ssi: ودھِیک ٻول اپ لوڈ کرو؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
ssi: اس کلپا کا اپ لوڈ سروانٚم اسپھݪ ہووتا رہتا ہے۔ پنیں کُو پُوٹھا لوڈ کرو یا پیچھیں پُوٹھا جتن کرو۔

source: Upload of this clip keeps failing, keep retrying?
ssi: اس کلپا کُو اپ لوڈ کرنا اسپھݪ ہووتا رہتا ہے، پُوٹھا جتن کرتے ریہو؟

source: Urdu
ssi: اُڑدُو

source: Use correct grammar
ssi: اِدؔائے ٻول اُپیوگ کرو

source: Use correct spelling and grammar
ssi: سئی ہِجے اور ٻولیں کا اُپیوگ کرو

source: Use correct spelling and grammar.
ssi: سئی ہِجے اور ٻولیں کا اُپیوگ کرو۔

source: Use correct spelling and punctuation
ssi: اِدؔائے ہِجے اور نِساٹؔینٚئیں کُو اُپیوگ کرو

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
ssi: <mark>نج بھاشݨا کے سرے</mark> اور کرنواڑے ماملیں نتر اجرا ہے (سرے کی ٻات ہے، جِدؔ آپ ٻِنا لِکھوڑے اور ٻول چالا کے ٻوݪݨواڑے مِنکھیں کے سات کام کرنا چاہوتے ہے)

source: User Name
ssi: لیݨواڑا نانٚوَ

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
ssi: اُپیوگ کرتا دؔان کرنوَاڑا کلپیں کی سئی ہووَٹؔیں کی پک کرتا ہے ، یو جانٚچ کرنوَاڑے کے پڑھنوَاڑین ٻولیں کُو سئی نامُونینٚس پڑھا ہے۔

source: Ushojo
ssi: اوشوجو

source: Uyghur
ssi: ترکستانی

source: Uzbek
ssi: اُزبيک

source: Validated Clips
ssi: پک کروڑے ٹُکڑے

source: Validated Hours
ssi: پک کروڑے کلاک

source: Validated Hr. Total
ssi: پکا کروڑا ہر کُل

source: Validate readings
ssi: پڑھائِیا کی جانچ کر

source: Validate Readings
ssi: پڑھنے کی اوݪکھ کرو

source: Validate Readings, Review Transcriptions
ssi: ریڈنگا کی اوݪکھ کرو، نکݪِیا کُو ایدؔائے دؔیکھو

source: Validate Readings <small>(Coming soon)</small>
ssi: ریڈنگا کی اوݪکھ کرو <small>(ٻیگے آئی رے ہے)</small>

source: Validate readings submitted by community members
ssi: پیڑے کے میبریں کی ترپھاس بھیݪی کروڑی پرکھوڑی لِکھت
